[
  {
    "id": 1,
    "position": "PHP Intern",
    "company": "Software Engineering Dept.",
    "startDate": "2023-07-01",
    "endDate": "2023-10-01",
    "achievements": [
      "Developed new features and transformed UI designs into fully functional user interfaces.",
      "Optimized application performance to ensure a smooth and engaging user experience.",
      "Supported other team members initiatives by developing solutions to common problems and sharing those solutions.",
      "Identified and resolved bugs, improving app stability and performance.",
      "Wrote clean, maintainable, and testable code following best practices.",
      "Utilization of latest version of support libraries to ensure backend compatibility.",
      "Collaborated with backend developers, designers, and cross-functional teams to deliver scalable, high-quality solutions."
    ]
  },
  {
    "id": 2,
    "position": "Project Team Lead",
    "company": "Know the Blocks Maven (KBM)",
    "startDate": "2024-07-01",
    "endDate": "2024-10-08",
    "achievements": [
      "Coordinated and lead a team of interns in the successful implementation of a layer 2 scaling solution.",
      "Consistently achieved 85% compliance with industry best practices.",
      "Applied the concept of elliptic curve cryptography to programming.",
      "Developed custom bank and token using solidity programming language.",
      "Integrated APIs for seamless data communication and backend functionality.",
      "Collaborated with other developers and backend team to deliver features.",
      "Led team meetings to discuss progress, roadblocks, and next steps, fostering collaboration and effective communication.",
      "Performed code review, deployed, and verified bank contract in various network."
    ]
  },
  {
    "id": 3,
    "position": "Computer Support Technician",
    "company": "Self-employed",
    "startDate": "2023-11-01",
    "endDate": "2024-10-01",
    "achievements": [
      "Installed and configured Ubuntu on HP and Dell laptops for students.",
      "Resolved driver and boot-loader issues, enabling dual-boot and UEFI/BIOS compatibility.",
      "Performed manual partitioning, GRUB repair, and kernel module tweaking for hardware compatibility."
    ]
  },
  {
    "id": 4,
    "position": "Blockchain Developer",
    "company": "Web3Bridge",
    "startDate": "2025-07-01",
    "endDate": "present",
    "achievements": [
      "Implemented a DAO for voting on proposals.",
      "Implemented a secure data storage on blockchain while optimising performance.",
      "Implemented an AI marketplace on blockchain."
    ]
  },
  {
    "id": 5,
    "position": "Coding Mentor",
    "company": "Learn2Earn",
    "startDate": "2025-11-01",
    "endDate": "present",
    "achievements": [
      "Guide students using the peer-to-peer learning platform.",
      "Conduct code reviews and offer mentorship support.",
      "Facilitate group activities and maintain platform engagement.",
      "Support technical events and collaborations.",
      "Monitor learners’ progress and report challenges or bugs.",
      "Uphold Learn2Earn NG's policies on data protection, equity, and safe learning.",
      "Ensure a deep understanding of the peer-to-peer pedagogy and its concrete",
      "applications, with the ability to explain it to different stakeholders.",
      "Communicate and support students during the Learning period.",
      "Perform database queries for analytics and insights.",
      "Ensure students’ progress at the expected pace.",
      "Engage with employers and partners for program enrichment.",
      "Monitor and audit student work for individual support.",
      "Maintain clear records of student activity and progress.",
      "Promoting a collaborative environment, based on autonomy and peer learning.",
      "Ensure service needs, including working occasionally on evenings and weekends"
    ]
  }
]